//========================================================================================================================================================
// Задание No1. Переменные

// let admin
// let name = 'Алексей'
// admin = name
// alert(admin)
//========================================================================================================================================================
// Задание No2. Константы

// const BIRTHDAY = '18.04.1982' // использовать заглавные буквы?   Здесь можно использовать, т.к. значение известно до выполнения скрипта
// const AGE = someCode(BIRTHDAY) // а здесь? Нельзя использовать, т.к. переменная age вычисляется во время выполнения скрипта и значение может меняться со временем
//========================================================================================================================================================
// Задание No3. Строки
// Что выведет этот скрипт:

// let name = "Ilya";
// alert( `hello ${1}` );        //hello 1
// alert( `hello ${"name"}` );   //hello name
// alert( `hello ${name}` );  	//hello Ilya
//========================================================================================================================================================
// Задание No4. Преобразования типов
// Какой результат будет у выражений ниже?

// "" + 1 + 0    //10
// "" - 1 + 0    //-1
// true + false  //1
// 6 / "3"       //2
// "2" * "3"     //6
// 4 + 5 + "px"  //'9px'
// "$" + 4 + 5   //'$45'
// "4" - 2       //2
// "4px" - 2     //NaN
// 7 / 0         //Infinity
// " -9 " + 5    //" -9 5"
// " -9 " - 5    //14
// null + 1      //1
// undefined + 1 //NaN
//========================================================================================================================================================
// Задание No5. Постфиксная и префиксная формы
// Чему будут равны переменные a, b, c и d в примере ниже?

// let a = 1, b = 1;
// let c = ++a;     //a = 2, b = 2, c = 2, d = 1
// let d = b++;
//========================================================================================================================================================
// Задание No6. Результат присваивания
// Чему будут равны переменные a и x в примере ниже?

// let a = 2;
// let x = 1 + (a *= 2);  //a = 4, x = 5
//========================================================================================================================================================
// Задание No7. Операторы сравнения
// Каким будет результат этих выражений?

// 5 > 4                  //true
// "ананас" > "яблоко"    //false
// "2" > "12"             //true
// undefined == null      //true
// undefined === null     //false
// null == "\n0\n"        //false
// null === +"\n0\n"      //false
//========================================================================================================================================================
// Задание No8. Операторы взаимодействия
// Создайте страницу, которая спрашивает имя у пользователя и выводит его.

// let userName = prompt('Как Вас зовут?', '')
// alert(userName)
//========================================================================================================================================================
// Задание No9. Условные операторы
// Выведется ли alert?

// if ('0') {
// 	alert('Привет') //Да, выведется, т.к. строка не пуста, значение true.
// }
//========================================================================================================================================================
// Задание No10. Условные операторы
// Используя конструкцию if..else, напишите код, который будет спрашивать: „Каково
// «официальное» название JavaScript?“
// Если пользователь вводит «ECMAScript», то показать: «Верно!», в противном случае –
// отобразить: «Не знаете? ECMAScript!»

// let question = prompt('Каково «официальное» название JavaScript?', '')

// if (question == 'ECMAScript') {
// 	alert('Верно')
// } else {
// 	alert('Не знаете? ECMAScript!')
// }
//========================================================================================================================================================
// Задание No11. Покажите знак числа
// Используя конструкцию if..else, напишите код, который получает число через prompt, а
// затем выводит в alert:
// 1, если значение больше нуля,
// -1, если значение меньше нуля,
// 0, если значение равно нулю.
// Предполагается, что пользователь вводит только числа.

// let number = prompt('Введите число', '')

// if (number > 0) {
// 	alert(1)
// } else if (number < 0) {
// 	alert(-1)
// } else if (number == 0) {
// 	alert(0)
// }
//========================================================================================================================================================
// Задание No12. Перепишите 'if' в '?'
// Перепишите if с использованием условного оператора '?':

// let result
// if (a + b < 4) {
// 	result = 'Мало'
// } else {
// 	result = 'Много'
// }

// let result = a + b < 4 ? 'Мало' : 'Много'
//========================================================================================================================================================
// Задание No13. Перепишите 'if..else' в '?'
// Перепишите if..else с использованием нескольких операторов '?'.
// Для читаемости рекомендуется разбить код на несколько строк.

// let message
// if (login == 'Сотрудник') {
// 	message = 'Привет'
// } else if (login == 'Директор') {
// 	message = 'Здравствуйте'
// } else if (login == '') {
// 	message = 'Нет логина'
// } else {
// 	message = ''
// }

// let message = (login == 'Сотрудник') ? 'Привет' :
// (login == 'Директор') ? 'Здравствуйте' :
// (login == '') ? 'Нет логина' :
// ''
//========================================================================================================================================================
// Задание No14. ИЛИ
// Что выведет код ниже?

// alert( null || 2 || undefined );      //2
//========================================================================================================================================================
// Задание No15. ИЛИ
// Что выведет код ниже?

// alert( alert(1) || 2 || alert(3) ); // Сначала 1, потом 2
//========================================================================================================================================================
// Задание No16. И
// Что выведет код ниже?

// alert( 1 && null && 2 );  //null
//========================================================================================================================================================
// Задание No17. И
// Что выведет код ниже?

// alert(alert(1) && alert(2)); //Сначала 1, потом undefined
//========================================================================================================================================================
// Задание No18.
// Что выведет код ниже?

// alert( null || 2 && 3 || 4 ); //3
//========================================================================================================================================================
// Задание No19. Проверка значения из диапазона
// Напишите условие if для проверки, что переменная age находится в диапазоне между
// 14 и 90 включительно.
// «Включительно» означает, что значение переменной age может быть равно 14 или 90.

// if (age >= 14 && age <= 90)
//========================================================================================================================================================
// Задание No20. Проверка значения вне диапазона
// Напишите условие if для проверки, что значение переменной age НЕ находится в
// диапазоне 14 и 90 включительно.
// Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого
// оператора.

// if (!(age >= 14 && age <= 90))
// if (age < 14 || age > 90)
//========================================================================================================================================================
// Задание No21. If
// Какие из перечисленных ниже alert выполнятся?
// Какие конкретно значения будут результатами выражений в условиях if(...)?

// if (-1 || 0) alert( 'first' );           //выполнится,  в условиях if(-1)
// if (-1 && 0) alert( 'second' );          //не выполнится,  в условиях if(0 - false)
// if (null || -1 && 1) alert( 'third' );   //выполнится,  в условиях if(1)
//========================================================================================================================================================
// Задание No22. Проверка логина
// Напишите код, который будет спрашивать логин с помощью prompt.

// Если посетитель вводит «Админ», то prompt запрашивает пароль, если ничего не
// введено или нажата клавиша Esc – показать «Отменено», в противном случае
// отобразить «Я вас не знаю».
// Пароль проверять так:
// 1. Если введён пароль «Я главный», то выводить «Здравствуйте!»,
// 2. Иначе – «Неверный пароль»,
// 3. При отмене – «Отменено».

// let user = prompt('Добрый день')

// if (user == 'Админ') {
// 	let login = prompt('Введите пароль', '')

// 	if (login == 'Я главный') {
// 		alert('Здравствуйте!')
// 	} else if (login == null || login == '') {
// 		alert('Отменено')
// 	} else {
// 		alert('Неверный пароль')
// 	}
// } else if (user == null || user == '') {
// 	alert('Отменено')
// } else {
// 	alert('Я вас не знаю')
// }
//========================================================================================================================================================
// Задание No23. Напишите "if", аналогичный "switch"
// Напишите if..else, соответствующий следующему switch:

// switch (browser) {
// case 'Edge':
// alert( "You've got the Edge!" );
// break;
// case 'Chrome':
// case 'Firefox':
// case 'Safari':
// case 'Opera':
// alert( 'Okay we support these browsers too' );
// break;
// default:
// alert( 'We hope that this page looks ok!' );
// }

// let browser = prompt('')

// if (browser === 'Edge') {
// 	alert("You've got the Edge!")
// } else if (browser === 'Chrome' || browser === 'Firefox' || browser === 'Safari' || browser === 'Opera') {
// 	alert('Okay we support these browsers too')
// } else {
// 	alert('We hope that this page looks ok!')
// }
//========================================================================================================================================================
// Задание No24. Переписать условия "if" на "switch"
// Перепишите код с использованием одной конструкции switch:

// let a = +prompt('a?', '')
// if (a == 0) {
// 	alert(0)
// }
// if (a == 1) {
// 	alert(1)
// }
// if (a == 2 || a == 3) {
// 	alert('2,3')
// }

// let a = +prompt('a?', '');

// switch (a) {
// 	case 0:
// 		alert(0);
// 		break;
// 	case 1:
// 		alert(1);
// 		break;
// 	case 2:
// 	case 3:
// 		alert('2,3');
// 		break;
// }
//========================================================================================================================================================
// Задание No25.
// Дано целое число. Если оно является положительным, то прибавить к нему 1; в
// противном случае не изменять его. Вывести полученное число.

// let a = +prompt('Введите число');

// if (a >= 0) {
// 	alert(a + 1);
// } else {
// 	alert(a);
// }
//========================================================================================================================================================
// Задание No26.
// Дано целое число. Если оно является положительным, то прибавить к нему 1; в
// противном случае вычесть из него 2. Вывести полученное число.

// let a = +prompt('Введите число');

// if (a >= 0) {
// 	alert(a + 1);
// } else {
// 	alert(a - 2);
// }
//========================================================================================================================================================
// Задание No27.
// Дано целое число. Если оно является положительным, то прибавить к нему 1; если
// отрицательным, то вычесть из него 2; если нулевым, то заменить его на 10. Вывести
// полученное число.

// let a = +prompt('Введите число');

// if (a > 0) {
// 	alert(a + 1);
// } else if (a < 0) {
// 	alert(a - 2);
// } else if (a == 0) {
// 	alert((a = 10));
// }
//========================================================================================================================================================
// Задание No28.
// Даны три целых числа. Найти количество положительных чисел в исходном наборе.

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// function findPositive(first, second, third) {
// 	let counter = 0;

// 	counter += isPositive(first);
// 	counter += isPositive(second);
// 	counter += isPositive(third);

// 	alert(`positive №: ${counter}`);
// }

// function isPositive(num) {
// 	return num > 0 ? 1 : 0;
// }

// findPositive(a, b, c);

//========================================================================================================================================================
// Задание No29. Даны три целых числа. Найти количество положительных и количество
// отрицательных чисел в исходном наборе.

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// function findPositiveNegative(first, second, third) {
// 	let positive = 0;
// 	let negative = 0;

// 	if (isPositive(first)) {
// 		positive += 1;
// 	} else {
// 		negative += 1;
// 	}

// 	if (isPositive(second)) {
// 		positive += 1;
// 	} else {
// 		negative += 1;
// 	}

// 	if (isPositive(third)) {
// 		positive += 1;
// 	} else {
// 		negative += 1;
// 	}
// 	alert(`positive: ${positive}\nnegative: ${negative}`);
// }

// function isPositive(num) {
// 	return num > 0 ? 1 : 0;
// }

// findPositiveNegative(a, b, c);
//========================================================================================================================================================
// Задание No30.
// Даны два числа. Вывести большее из них.

// let a = 10;
// let b = 20;

// if (a > b) {
// 	console.log(a);
// } else {
// 	console.log(b);
// }
//========================================================================================================================================================
// Задание No31.
// Даны два числа. Вывести порядковый номер меньшего из них.

// let a = +prompt('Введите первое число', '');
// let b = +prompt('Введите второе число', '');

// if (a < b) {
// 	alert('Номер: 1');
// } else {
// 	alert('Номер: 2');
// }
//========================================================================================================================================================
// Задание No32.
// Даны два числа. Вывести вначале большее, а затем меньшее из них.

// let a = +prompt('Введите первое число', '');
// let b = +prompt('Введите второе число', '');

// if (a > b) {
// 	alert(a);
// 	alert(b);
// } else {
// 	alert(b);
// 	alert(a)
// }
//========================================================================================================================================================
// Задание No33. Даны две переменные вещественного типа: A, B. Перераспределить
// значения данных переменных так, чтобы в A оказалось меньшее из значений, а в B —
// большее. Вывести новые значения переменных A и B.

// let A = +prompt('Первое число', '');
// let B = +prompt('Второе число', '');

// let tmp = Math.min(A, B);
// B = Math.max(A, B);
// A = tmp;

// alert(`A: ${A}`);
// alert(`B: ${B}`);
//========================================================================================================================================================
// Задание No34.
// Даны две переменные целого типа: A и B. Если их значения не равны, то присвоить
// каждой переменной сумму этих значений, а если равны, то присвоить переменным
// нулевые значения. Вывести новые значения переменных A и B.

// let A = +prompt('Первое число', '');
// let B = +prompt('Второе число', '');

// if (A != B) {
// 	A += B;
// 	B = A;
// } else {
// 	A = 0;
// 	B = 0;
// }

// alert(`A: ${A}`);
// alert(`B: ${B}`);
//========================================================================================================================================================
// Задание No35.
// Даны две переменные целого типа: A и B. Если их значения не равны, то присвоить
// каждой переменной большее из этих значений, а если равны, то присвоить
// переменным нулевые значения. Вывести новые значения переменных A и B.

// let A = +prompt('Первое число', '');
// let B = +prompt('Второе число', '');

// if (A != B) {
// 	A = Math.max(A, B);
// 	B = A;
// } else {
// 	A = 0;
// 	B = 0;
// }

// alert(`A: ${A}`);
// alert(`B: ${B}`);
//========================================================================================================================================================
// Задание No36.
// Даны три числа. Найти наименьшее из них.

//  let a = +prompt('Первое число');
//  let b = +prompt('Второе число');
//  let c = +prompt('Третье число');

//  let result = Math.min(a, b, c);
//  alert(result);
//========================================================================================================================================================
// Задание No37.
// Даны три числа. Найти среднее из них (то есть число, расположенное между
// наименьшим и наибольшим).

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// if (a > c && a > b) {
// 	if (c > b) {
// 		alert(c);
// 	} else {
// 		alert(b);
// 	}
// } else if (b > a && b > c) {
// 	if (a > c) {
// 		alert(a);
// 	} else {
// 		alert(c);
// 	}
// } else if (c > a && c > b) {
// 	if (a > b) {
// 		alert(a);
// 	} else {
// 		alert(b);
// 	}
// }
//========================================================================================================================================================
// Задание No38.
// Даны три числа. Вывести вначале наименьшее, а затем наибольшее из данных чисел.

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// alert(Math.min(Math.min(a, b, c)));
// alert(Math.max(Math.max(a, b, c)));
//========================================================================================================================================================
// Задание No39.
// Даны три числа. Найти сумму двух наибольших из них.

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// if (c <= a && c <= b) {
// 	alert(a + b);
// } else if (b <= a && b <= c) {
// 	alert(a + c);
// } else {
// 	alert(b + c);
// }
//========================================================================================================================================================
// Задание No40.
// Даны три целых числа, одно из которых отлично от двух других, равных между собой.
// Определить порядковый номер числа, отличного от остальных.

// let a = +prompt('Первое число');
// let b = +prompt('Второе число');
// let c = +prompt('Третье число');

// if (b == c) {
// 	alert(1);
// } else if (a == c) {
// 	alert(2);
// } else if (a == b) {
// 	alert(3);
// }

